DataProcessors/ТК_ОбменСайтДигма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ТК_ОбменСайтДигма</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/РезультатыВыполненияОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РезультатыВыполненияОбработок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Успешный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СообщенияОбОшибках</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ТК_ОбменСайтДигма/Ext/ObjectModule.bsl
Процедура ВыполнитьОбмен(ВсеКарты = Ложь)Экспорт
	
	
	СтруктруаЗаписиРезультатаВыполнения = РегистрыСведений.РезультатыВыполненияОбработок.СформироватьСтруктуруЗаписиРезультатов();
	СтруктруаЗаписиРезультатаВыполнения.ИдентификаторОбработки = "ТК_ОбменСайтДигма";
	СтруктруаЗаписиРезультатаВыполнения.КлючОбработки = "Загрузка ДК карт контактная информация";

	РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий(ИмяКомпьютера(), СтруктруаЗаписиРезультатаВыполнения, Неопределено);

	
	
	Попытка
		Если ВсеКарты Тогда
			ТекстЗапроса = "getusers.php";
		Иначе
			ТекстЗапроса = "getusers.php?show=latest";
		КонецЕсли;
		Соединение = Новый HTTPСоединение("digma.ua",,,,,,Новый ЗащищенноеСоединениеOpenSSL());
		Запрос = Новый HTTPЗапрос(ТекстЗапроса);
		Результат = Соединение.Получить(Запрос);
		
		Если Результат.КодСостояния = 200 Тогда
			
			ТекстОтвета = Результат.ПолучитьТелоКакСтроку();
			РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий("Строк на загрузку: "+?(ПустаяСтрока(ТекстОтвета),"0",СтрЧислоСтрок(ТекстОтвета)), СтруктруаЗаписиРезультатаВыполнения, Неопределено);

			
			Если ПустаяСтрока(ТекстОтвета) Тогда
				 РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, Истина);
			
				Возврат;
			КонецЕсли;
			
			хЗнач = Новый ХранилищеЗначения(ТекстОтвета,Новый СжатиеДанных(9));
			
			Определение = Новый WSОпределения("http://orders:8096/work_Global_Center/ws3.1cws?WSDL");
			WS = Новый WSПрокси(Определение,"http://v8.1c.ru/8.1/data/core", "Exchange", "ExchangeSoap");
			
			Ошибки = "";
			Рез = WS.ОбновитьИнформациюДК(хЗнач,Ошибки);
			Если Рез = 0 Тогда
				РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, Истина);
			Иначе
				РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Описание ошибки "+Ошибки, СтруктруаЗаписиРезультатаВыполнения);
				РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, Ложь);
				
			КонецЕсли;
			
			
		Иначе
			РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("КодСостояния "+Результат.КодСостояния, СтруктруаЗаписиРезультатаВыполнения);
			РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Тело запроса "+Результат.ПолучитьТелоКакСтроку(), СтруктруаЗаписиРезультатаВыполнения);
			РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, Ложь);

			
		КонецЕсли;
	Исключение
		РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Описание ошибки "+ОписаниеОшибки(), СтруктруаЗаписиРезультатаВыполнения);
		РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, Ложь);

	КонецПопытки;


КонецПроцедуры
